In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Category':['A','B','A','B','A','B','A','B'],
    'Store':['S1','S1','S2','S2','S1','S2','S2','S1'],
    'Sales':[100,200,150,250,120,180,200,300],
    'Quantity':[10,15,12,18,8,20,15,25],
     'Date':pd.date_range('2023-01-01',periods=8)
}

df = pd.DataFrame(data)

In [6]:
cat = df.groupby('Category')['Sales'].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

In [7]:
store_groupby = df.groupby('Store')['Sales'].sum()
store_groupby

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [8]:
cat = df.groupby(['Category','Store'])['Sales'].sum()
cat

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [9]:
df['Sales'].mean()

np.float64(187.5)

In [10]:
df['Sales'].median()

190.0

In [11]:
df['Sales'].mode()

0    200
Name: Sales, dtype: int64

In [15]:
df['Sales'].agg(['sum','mean','min','max','count','median'])

sum       1500.0
mean       187.5
min        100.0
max        300.0
count        8.0
median     190.0
Name: Sales, dtype: float64